In [1]:
import pandas as pd

In [4]:
import numpy as np
data = np.array(['p','y','t','h','o','n'])

In [5]:
my_series=pd.Series(data)
print(my_series)

0    p
1    y
2    t
3    h
4    o
5    n
dtype: object

In [6]:
type(my_series)

pandas.core.series.Series

In [7]:
l=[1,2,4,5]
ser=pd.Series(l)
print(ser)

0    1
1    2
2    4
3    5
dtype: int64

In [11]:
ser[0:3]

0    1
1    2
2    4
dtype: int64

In [12]:
data=np.array(['p','y','t','h','o','n','p','r','o','g'])
s=pd.Series(data,index=[10,20,30,40,50,60,70,80,90,100])
print(s[50])

o

In [13]:
s.loc[30:70]

30    t
40    h
50    o
60    n
70    p
dtype: object

In [14]:
s.iloc[30:70]

Series([], dtype: object)

In [20]:
s.loc[2:3]

Series([], dtype: object)

In [21]:
df=pd.read_csv("/content/HR_comma_sep.csv")

In [22]:
df.head()

   satisfaction_level  last_evaluation  ...  Departments   salary
0                0.38             0.53  ...         sales     low
1                0.80             0.86  ...         sales  medium
2                0.11             0.88  ...         sales  medium
3                0.72             0.87  ...         sales     low
4                0.37             0.52  ...         sales     low

[5 rows x 10 columns]

In [23]:
df.tail()

       satisfaction_level  last_evaluation  ...  Departments   salary
14994                0.40             0.57  ...       support     low
14995                0.37             0.48  ...       support     low
14996                0.37             0.53  ...       support     low
14997                0.11             0.96  ...       support     low
14998                0.37             0.52  ...       support     low

[5 rows x 10 columns]

In [24]:
df.columns

Index(['satisfaction_level', 'last_evaluation', 'number_project',
       'average_montly_hours', 'time_spend_company', 'Work_accident', 'left',
       'promotion_last_5years', 'Departments ', 'salary'],
      dtype='object')

In [25]:
df.shape

(14999, 10)

In [26]:
df.iloc[1:4,1:3]

   last_evaluation  number_project
1             0.86               5
2             0.88               7
3             0.87               5

In [27]:
for i in df.head().iterrows():
  print(i)

(0, satisfaction_level        0.38
last_evaluation           0.53
number_project               2
average_montly_hours       157
time_spend_company           3
Work_accident                0
left                         1
promotion_last_5years        0
Departments              sales
salary                     low
Name: 0, dtype: object)
(1, satisfaction_level          0.8
last_evaluation            0.86
number_project                5
average_montly_hours        262
time_spend_company            6
Work_accident                 0
left                          1
promotion_last_5years         0
Departments               sales
salary                   medium
Name: 1, dtype: object)
(2, satisfaction_level         0.11
last_evaluation            0.88
number_project                7
average_montly_hours        272
time_spend_company            4
Work_accident                 0
left                          1
promotion_last_5years         0
Departments               sales
salary                   medium
Name: 2, dtype: object)
(3, satisfaction_level        0.72
last_evaluation           0.87
number_project               5
average_montly_hours       223
time_spend_company           5
Work_accident                0
left                         1
promotion_last_5years        0
Departments              sales
salary                     low
Name: 3, dtype: object)
(4, satisfaction_level        0.37
last_evaluation           0.52
number_project               2
average_montly_hours       159
time_spend_company           3
Work_accident                0
left                         1
promotion_last_5years        0
Departments              sales
salary                     low
Name: 4, dtype: object)

In [28]:
df.describe()

       satisfaction_level  last_evaluation  ...          left  promotion_last_5years
count        14999.000000     14999.000000  ...  14999.000000           14999.000000
mean             0.612834         0.716102  ...      0.238083               0.021268
std              0.248631         0.171169  ...      0.425924               0.144281
min              0.090000         0.360000  ...      0.000000               0.000000
25%              0.440000         0.560000  ...      0.000000               0.000000
50%              0.640000         0.720000  ...      0.000000               0.000000
75%              0.820000         0.870000  ...      0.000000               0.000000
max              1.000000         1.000000  ...      1.000000               1.000000

[8 rows x 8 columns]

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14999 entries, 0 to 14998
Data columns (total 10 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   satisfaction_level     14999 non-null  float64
 1   last_evaluation        14999 non-null  float64
 2   number_project         14999 non-null  int64
 3   average_montly_hours   14999 non-null  int64
 4   time_spend_company     14999 non-null  int64
 5   Work_accident          14999 non-null  int64
 6   left                   14999 non-null  int64
 7   promotion_last_5years  14999 non-null  int64
 8   Departments            14999 non-null  object
 9   salary                 14999 non-null  object
dtypes: float64(2), int64(6), object(2)
memory usage: 1.1+ MB

In [32]:
df.sort_values('Departments ').head()

      satisfaction_level  last_evaluation  ...  Departments   salary
3808                0.85             0.92  ...            IT  medium
5253                0.95             0.78  ...            IT     low
5252                0.82             0.60  ...            IT  medium
9000                0.82             0.89  ...            IT  medium
8995                0.74             0.89  ...            IT  medium

[5 rows x 10 columns]

In [33]:
df.sort_values('satisfaction_level',ascending=False).head()

       satisfaction_level  last_evaluation  ...  Departments   salary
2111                  1.0             0.92  ...       support     low
10125                 1.0             0.66  ...       support  medium
5938                  1.0             0.59  ...    management  medium
4724                  1.0             0.73  ...   product_mng     low
10906                 1.0             0.73  ...   product_mng     low

[5 rows x 10 columns]

In [34]:
df.sort_values(['number_project','satisfaction_level']).head()

       satisfaction_level  last_evaluation  ...  Departments   salary
622                  0.10             0.55  ...         sales  medium
12622                0.10             0.55  ...         sales  medium
14833                0.10             0.55  ...         sales  medium
985                  0.11             0.55  ...         RandD     low
5005                 0.12             0.60  ...     technical  medium

[5 rows x 10 columns]

In [35]:
df.head()

   satisfaction_level  last_evaluation  ...  Departments   salary
0                0.38             0.53  ...         sales     low
1                0.80             0.86  ...         sales  medium
2                0.11             0.88  ...         sales  medium
3                0.72             0.87  ...         sales     low
4                0.37             0.52  ...         sales     low

[5 rows x 10 columns]

In [36]:
df['new_col']=df['satisfaction_level']*df['number_project']

In [37]:
df.head()

   satisfaction_level  last_evaluation  ...  salary  new_col
0                0.38             0.53  ...     low     0.76
1                0.80             0.86  ...  medium     4.00
2                0.11             0.88  ...  medium     0.77
3                0.72             0.87  ...     low     3.60
4                0.37             0.52  ...     low     0.74

[5 rows x 11 columns]

In [38]:
df1=df.drop(columns='new_col')

In [39]:
df1.head()

   satisfaction_level  last_evaluation  ...  Departments   salary
0                0.38             0.53  ...         sales     low
1                0.80             0.86  ...         sales  medium
2                0.11             0.88  ...         sales  medium
3                0.72             0.87  ...         sales     low
4                0.37             0.52  ...         sales     low

[5 rows x 10 columns]

In [40]:
df.head().loc[df['satisfaction_level']==0.38]

   satisfaction_level  last_evaluation  ...  salary  new_col
0                0.38             0.53  ...     low     0.76

[1 rows x 11 columns]

In [41]:
nf=df.loc[(df['number_project']==2) & (df['satisfaction_level']==0.37)]

In [42]:
nf.head()

     satisfaction_level  last_evaluation  ...  salary  new_col
4                  0.37             0.52  ...     low     0.74
55                 0.37             0.46  ...     low     0.74
88                 0.37             0.57  ...     low     0.74
95                 0.37             0.51  ...     low     0.74
115                0.37             0.48  ...  medium     0.74

[5 rows x 11 columns]

In [44]:
nf.to_csv('filtered.csv')

In [45]:
ds=pd.read_csv('filtered.csv')
ds.head()

   Unnamed: 0  satisfaction_level  ...  salary  new_col
0           4                0.37  ...     low     0.74
1          55                0.37  ...     low     0.74
2          88                0.37  ...     low     0.74
3          95                0.37  ...     low     0.74
4         115                0.37  ...  medium     0.74

[5 rows x 12 columns]

In [47]:
df.loc[df['number_project']==2,'left']=True

In [48]:
df.head()

   satisfaction_level  last_evaluation  ...  salary  new_col
0                0.38             0.53  ...     low     0.76
1                0.80             0.86  ...  medium     4.00
2                0.11             0.88  ...  medium     0.77
3                0.72             0.87  ...     low     3.60
4                0.37             0.52  ...     low     0.74

[5 rows x 11 columns]